In [2]:
import pandas as pd
import numpy as np

In [3]:
"""
<< Chapter 7 >>
    
    <<< Section 1 Handling Missing Data >>>

"""

'\n\n<<< Chapter 7.1 Handling Missing Data >>>\n\n'

In [4]:
float_data = pd.Series([1.2, -3.5, np.nan, 0])

In [5]:
float_data

0    1.2
1   -3.5
2    NaN
3    0.0
dtype: float64

In [6]:
float_data.isna()

0    False
1    False
2     True
3    False
dtype: bool

In [7]:
string_data = pd.Series(["aardvark", np.nan, None, "avocado"])

In [8]:
string_data

0    aardvark
1         NaN
2        None
3     avocado
dtype: object

In [9]:
string_data.isna()

0    False
1     True
2     True
3    False
dtype: bool

In [10]:
float_data = pd.Series([1, 2, None], dtype="float64")

In [11]:
float_data

0    1.0
1    2.0
2    NaN
dtype: float64

In [12]:
float_data.isna()

0    False
1    False
2     True
dtype: bool

In [13]:
float_data.dropna()

0    1.0
1    2.0
dtype: float64

In [15]:
float_data.fillna(0)

0    1.0
1    2.0
2    0.0
dtype: float64

In [17]:
float_data.notna()

0     True
1     True
2    False
dtype: bool

In [24]:
"""
<< Chapter 7 >>
    
    <<< Section 1 Handling Missing Data >>>

        <<<< Filtering Missing Data >>>> 
"""

'\n<< Chapter 7 >>\n    \n    <<< Section 1 Handling Missing Data >>>\n\n        <<<< Filtering Missing Data >>>> \n'

In [19]:
data = pd.Series([1, np.nan, 3.5, np.nan, 7])

In [20]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [23]:
data[data.notna()] # Equivalent to data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [25]:
data = pd.DataFrame([[1., 6.5, 3.], [1., np.nan, np.nan], [np.nan, np.nan, np.nan], [np.nan, 6.5, 3.]])

In [26]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [27]:
data.dropna()

     0    1    2
0  1.0  6.5  3.0

In [28]:
data.dropna(how="all")

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [29]:
data[4] = np.nan

In [30]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [31]:
data.dropna(axis="columns", how="all")

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [32]:
df = pd.DataFrame(np.random.standard_normal((7, 3)))

In [33]:
df.iloc[:4, 1] = np.nan

In [34]:
df.iloc[:2, 2] = np.nan

In [35]:
df

          0         1         2
0 -0.337489       NaN       NaN
1 -0.584743       NaN       NaN
2  1.803661       NaN  0.064404
3 -0.530574       NaN -0.241950
4  0.733359 -1.179184  0.900303
5 -1.096782 -1.449720  0.816206
6 -1.920414  0.675405  1.045409

In [37]:
df.dropna()

          0         1         2
4  0.733359 -1.179184  0.900303
5 -1.096782 -1.449720  0.816206
6 -1.920414  0.675405  1.045409

In [38]:
df.dropna(thresh=2)

          0         1         2
2  1.803661       NaN  0.064404
3 -0.530574       NaN -0.241950
4  0.733359 -1.179184  0.900303
5 -1.096782 -1.449720  0.816206
6 -1.920414  0.675405  1.045409

In [39]:
"""
<< Chapter 7 >>
    
    <<< Section 1 Handling Missing Data >>>

        <<<< Filling in Missing Data >>>> 
"""

'\n<< Chapter 7 >>\n    \n    <<< Section 1 Handling Missing Data >>>\n\n        <<<< Filling in Missing Data >>>> \n'

In [40]:
df.fillna(0)

          0         1         2
0 -0.337489  0.000000  0.000000
1 -0.584743  0.000000  0.000000
2  1.803661  0.000000  0.064404
3 -0.530574  0.000000 -0.241950
4  0.733359 -1.179184  0.900303
5 -1.096782 -1.449720  0.816206
6 -1.920414  0.675405  1.045409

In [41]:
df.fillna({1: 0.5, 2: 0})

          0         1         2
0 -0.337489  0.500000  0.000000
1 -0.584743  0.500000  0.000000
2  1.803661  0.500000  0.064404
3 -0.530574  0.500000 -0.241950
4  0.733359 -1.179184  0.900303
5 -1.096782 -1.449720  0.816206
6 -1.920414  0.675405  1.045409

In [46]:
df = pd.DataFrame(np.random.standard_normal((6, 3)))

In [47]:
df.iloc[2:, 1] = np.nan

In [48]:
df.iloc[4:, 2] = np.nan

In [49]:
df

          0         1         2
0  1.704500 -0.780933  0.897171
1 -1.026612  0.715497  0.150917
2 -0.425935       NaN  1.006142
3  0.651473       NaN  0.498392
4  0.677278       NaN       NaN
5  0.918382       NaN       NaN

In [50]:
df.fillna(method="ffill")

/tmp/ipykernel_8933/3944122520.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method="ffill")

          0         1         2
0  1.704500 -0.780933  0.897171
1 -1.026612  0.715497  0.150917
2 -0.425935  0.715497  1.006142
3  0.651473  0.715497  0.498392
4  0.677278  0.715497  0.498392
5  0.918382  0.715497  0.498392

In [52]:
df.ffill()

          0         1         2
0  1.704500 -0.780933  0.897171
1 -1.026612  0.715497  0.150917
2 -0.425935  0.715497  1.006142
3  0.651473  0.715497  0.498392
4  0.677278  0.715497  0.498392
5  0.918382  0.715497  0.498392

In [54]:
df.ffill(limit=2)

          0         1         2
0  1.704500 -0.780933  0.897171
1 -1.026612  0.715497  0.150917
2 -0.425935  0.715497  1.006142
3  0.651473  0.715497  0.498392
4  0.677278       NaN  0.498392
5  0.918382       NaN  0.498392

In [55]:
data = pd.Series([1., np.nan, 3.5, np.nan, 7])

In [65]:
data.fillna(data.mean().round(2))

0    1.00
1    3.83
2    3.50
3    3.83
4    7.00
dtype: float64

In [80]:
df.fillna(data.mean())

          0         1         2
0  1.704500 -0.780933  0.897171
1 -1.026612  0.715497  0.150917
2 -0.425935  3.833333  1.006142
3  0.651473  3.833333  0.498392
4  0.677278  3.833333  3.833333
5  0.918382  3.833333  3.833333

In [82]:
"""
<< Chapter 7 >>
    
    <<< Section 2 Data Transformation >>>

        <<<< Removing Duplicates >>>> 
"""

'\n<< Chapter 7 >>\n    \n    <<< Section 2 Data Transformation >>>\n\n        <<<< Removing Duplicates >>>> \n'

In [85]:
data = pd.DataFrame({"k1":["one", "two"] * 3 + ["two"],
                      "k2": [1, 1, 2, 3, 3, 4, 4]})

In [86]:
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [87]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [90]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [91]:
data["v1"] = range(7)

In [92]:
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [93]:
data.drop_duplicates(subset=["k1"])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [94]:
data.drop_duplicates(["k1", "k2"], keep="last")

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

In [149]:
"""
<< Chapter 7 >>
    
    <<< Section 2 Data Transformation >>>

        <<<< Transforming Data Using a Function or Mapping >>>> 
"""

'\n<< Chapter 7 >>\n    \n    <<< Section 2 Data Transformation >>>\n\n        <<<< Transforming Data Using a Function or Mapping >>>> \n'

In [97]:
data = pd.DataFrame({"food": ["bacon", "pulled pork", "bacon", 
                              "pastrami", "corned beef", "bacon",
                              "pastrami", "honey ham", "nova lox"],
                     "ounces": [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})

In [98]:
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     pastrami     6.0
4  corned beef     7.5
5        bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [101]:
meat_to_animal = {
    "bacon": "pig",
    "pulled pork": "pig",
    "pastrami": "cow",
    "corned beef": "cow",
    "honey ham": "pig",
    "nova lox": "salmon",
}

In [102]:
data["animal"] = data["food"].map(meat_to_animal)

In [104]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     pastrami     6.0     cow
4  corned beef     7.5     cow
5        bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [107]:
del data["animal"]

In [105]:
def get_animal(x):
    return meat_to_animal[x]

In [111]:
data["animal"] = data["food"].map(get_animal)

In [112]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     pastrami     6.0     cow
4  corned beef     7.5     cow
5        bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [148]:
"""
<< Chapter 7 >>
    
    <<< Section 2 Data Transformation >>>

        <<<< Replacing Values >>>> 
"""

'\n<< Chapter 7 >>\n    \n    <<< Section 2 Data Transformation >>>\n\n        <<<< Replacing Values >>>> \n'

In [114]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])

In [115]:
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [116]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [119]:
data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [130]:
data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [131]:
data.replace({-999: np.nan, -1000: 0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [147]:
"""
<< Chapter 7 >>
    
    <<< Section 2 Data Transformation >>>

        <<<< Renaming Axis Indexes >>>> 
"""

'\n<< Chapter 7 >>\n    \n    <<< Section 2 Data Transformation >>>\n\n        <<<< Renaming Axis Indexes >>>> \n'

In [134]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
                    index=["Ohio","Colorado", "New York"],
                    columns=["one", "two", "three", "four"])

In [136]:
def transform(x):
    return x[:4].upper()

In [137]:
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [138]:
data.index = data.index.map(transform)

In [139]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [146]:
data.rename(index=str.title, columns=str.upper) # Leaves original unmodified

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [143]:
data.rename(index={"OHIO": "INDIANA"},
            columns={"three": "peekaboo"})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [145]:
"""
<< Chapter 7 >>
    
    <<< Section 2 Data Transformation >>>

        <<<< Discretization and Binning >>>> 
"""

'\n<< Chapter 7 >>\n    \n    <<< Section 2 Data Transformation >>>\n\n        <<<< Discretization and Binning >>>> \n'

In [150]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [151]:
bins = [18, 25, 35, 60, 100]

In [152]:
age_categories = pd.cut(ages, bins)

In [153]:
age_categories

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64, right]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [154]:
age_categories.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]], dtype='interval[int64, right]')

In [155]:
age_categories.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [156]:
age_categories.categories[0]

Interval(18, 25, closed='right')

In [157]:
pd.value_counts(age_categories)

/tmp/ipykernel_8933/3010498523.py:1: FutureWarning: pandas.value_counts is deprecated and will be removed in a future version. Use pd.Series(obj).value_counts() instead.
  pd.value_counts(age_categories)

(18, 25]     5
(25, 35]     3
(35, 60]     3
(60, 100]    1
Name: count, dtype: int64

In [158]:
age_categories.value_counts()

(18, 25]     5
(25, 35]     3
(35, 60]     3
(60, 100]    1
Name: count, dtype: int64

In [159]:
pd.cut(ages, bins, right=False)

[[18, 25), [18, 25), [25, 35), [25, 35), [18, 25), ..., [25, 35), [60, 100), [35, 60), [35, 60), [25, 35)]
Length: 12
Categories (4, interval[int64, left]): [[18, 25) < [25, 35) < [35, 60) < [60, 100)]

In [160]:
group_names = ["Youth", "YoungAdult", "MiddleAged", "Senior"]

In [161]:
pd.cut(ages, bins, labels=group_names)

['Youth', 'Youth', 'Youth', 'YoungAdult', 'Youth', ..., 'YoungAdult', 'Senior', 'MiddleAged', 'MiddleAged', 'YoungAdult']
Length: 12
Categories (4, object): ['Youth' < 'YoungAdult' < 'MiddleAged' < 'Senior']

In [163]:
data = np.random.uniform(size=20)

In [165]:
pd.cut(data, 4, precision=2)

[(0.73, 0.96], (0.73, 0.96], (0.5, 0.73], (0.73, 0.96], (0.73, 0.96], ..., (0.27, 0.5], (0.5, 0.73], (0.73, 0.96], (0.73, 0.96], (0.73, 0.96]]
Length: 20
Categories (4, interval[float64, right]): [(0.044, 0.27] < (0.27, 0.5] < (0.5, 0.73] < (0.73, 0.96]]

In [184]:
data = np.random.standard_normal(1000)

In [185]:
quartiles = pd.qcut(data, 4, precision=2)

In [186]:
quartiles

[(-0.66, 0.046], (-0.66, 0.046], (-2.59, -0.66], (0.67, 3.35], (0.046, 0.67], ..., (0.67, 3.35], (0.046, 0.67], (-0.66, 0.046], (0.67, 3.35], (0.67, 3.35]]
Length: 1000
Categories (4, interval[float64, right]): [(-2.59, -0.66] < (-0.66, 0.046] < (0.046, 0.67] < (0.67, 3.35]]

In [187]:
quartiles.value_counts()

(-2.59, -0.66]    250
(-0.66, 0.046]    250
(0.046, 0.67]     250
(0.67, 3.35]      250
Name: count, dtype: int64

In [188]:
pd.qcut(data, [0, 0.1, 0.5, 0.9, 1.]).value_counts()

(-2.578, -1.239]    100
(-1.239, 0.0463]    400
(0.0463, 1.269]     400
(1.269, 3.347]      100
Name: count, dtype: int64

In [189]:
"""
<< Chapter 7 >>
    
    <<< Section 2 Data Transformation >>>

        <<<< Detecting and Filtering Outliers >>>> 
"""

'\n<< Chapter 7 >>\n    \n    <<< Section 2 Data Transformation >>>\n\n        <<<< Detecting and Filtering Outliers >>>> \n'

In [190]:
data = pd.DataFrame(np.random.standard_normal((1000, 4)))

In [195]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.044440    -0.007062    -0.002939     0.019311
std       1.032885     1.009772     1.012304     1.017252
min      -3.490702    -3.255104    -3.728580    -3.457260
25%      -0.779291    -0.724561    -0.670835    -0.661925
50%      -0.050734     0.014308     0.011245     0.037375
75%       0.688639     0.688103     0.701929     0.687785
max       2.676723     3.890203     3.053910     3.458138

In [196]:
col = data[2]

In [200]:
col[col.abs() > 3]

600    3.05391
866   -3.72858
951   -3.12062
Name: 2, dtype: float64

In [201]:
data[(data.abs() > 3).any(axis="columns")]

            0         1         2         3
132  2.007492 -2.179479 -1.168649  3.458138
430 -0.707181  0.220979  0.051273 -3.457260
521 -3.490702  0.457453 -1.571662 -1.765285
600  0.076083 -0.046739  3.053910  2.100621
709  2.187845 -3.255104  0.531016 -1.451618
746 -0.790729  3.890203  1.340899 -0.377250
788 -3.143279 -0.785692  0.728365 -0.721717
866  0.674380 -0.594187 -3.728580  0.147416
923 -0.570538  3.036817  0.380550 -1.521415
951  2.676723  0.558816 -3.120620 -0.889232
990  0.783626 -3.020611 -2.803753  0.045620

In [202]:
data[data.abs() > 3] = np.sign(data) * 3

In [203]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.043806    -0.007713    -0.002144     0.019310
std       1.030941     1.005756     1.009352     1.014339
min      -3.000000    -3.000000    -3.000000    -3.000000
25%      -0.779291    -0.724561    -0.670835    -0.661925
50%      -0.050734     0.014308     0.011245     0.037375
75%       0.688639     0.688103     0.701929     0.687785
max       2.676723     3.000000     3.000000     3.000000

In [204]:
np.sign(data).head()

     0    1    2    3
0  1.0  1.0  1.0  1.0
1  1.0  1.0 -1.0 -1.0
2  1.0 -1.0  1.0 -1.0
3  1.0 -1.0 -1.0 -1.0
4  1.0  1.0 -1.0 -1.0

In [205]:
"""
<< Chapter 7 >>
    
    <<< Section 2 Data Transformation >>>

        <<<< Permutation and Random Sampling >>>> 
"""

'\n<< Chapter 7 >>\n    \n    <<< Section 2 Data Transformation >>>\n\n        <<<< Permutation and Random Sampling >>>> \n'

In [206]:
df = pd.DataFrame(np.arange(5 * 7).reshape((5, 7)))

In [207]:
df

    0   1   2   3   4   5   6
0   0   1   2   3   4   5   6
1   7   8   9  10  11  12  13
2  14  15  16  17  18  19  20
3  21  22  23  24  25  26  27
4  28  29  30  31  32  33  34

In [210]:
sampler = np.random.permutation(5)

In [211]:
sampler

array([3, 0, 2, 4, 1])

In [212]:
df.take(sampler)

    0   1   2   3   4   5   6
3  21  22  23  24  25  26  27
0   0   1   2   3   4   5   6
2  14  15  16  17  18  19  20
4  28  29  30  31  32  33  34
1   7   8   9  10  11  12  13

In [213]:
df.iloc[sampler]

    0   1   2   3   4   5   6
3  21  22  23  24  25  26  27
0   0   1   2   3   4   5   6
2  14  15  16  17  18  19  20
4  28  29  30  31  32  33  34
1   7   8   9  10  11  12  13

In [214]:
column_sampler = np.random.permutation(7)

In [215]:
column_sampler

array([0, 2, 1, 5, 6, 4, 3])

In [216]:
df.take(column_sampler, axis="columns")

    0   2   1   5   6   4   3
0   0   2   1   5   6   4   3
1   7   9   8  12  13  11  10
2  14  16  15  19  20  18  17
3  21  23  22  26  27  25  24
4  28  30  29  33  34  32  31

In [217]:
df.sample(n=3)

    0   1   2   3   4   5   6
2  14  15  16  17  18  19  20
1   7   8   9  10  11  12  13
3  21  22  23  24  25  26  27

In [218]:
choices = pd.Series([5, 7, -1, 6, 4])

In [219]:
choices.sample(n=10, replace=True)

3    6
1    7
0    5
4    4
2   -1
2   -1
4    4
2   -1
1    7
3    6
dtype: int64

In [221]:
"""
<< Chapter 7 >>
    
    <<< Section 2 Data Transformation >>>

        <<<< Computing Indicator/Dummy Variables >>>> 
"""

'\n<< Chapter 7 >>\n    \n    <<< Section 2 Data Transformation >>>\n\n        <<<< Computing Indicator/Dummy Variables >>>> \n'

In [222]:
df = pd.DataFrame({"key": ["b", "b", "a", "c", "a", "b"],
                   "data1": range(6)})

In [223]:
df

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [226]:
pd.get_dummies(df["key"])

       a      b      c
0  False   True  False
1  False   True  False
2   True  False  False
3  False  False   True
4   True  False  False
5  False   True  False

In [232]:
dummies = pd.get_dummies(df["key"], dtype="float", prefix="key")

In [233]:
df_with_dummy = df[["data1"]].join(dummies)

In [234]:
df_with_dummy

   data1  key_a  key_b  key_c
0      0    0.0    1.0    0.0
1      1    0.0    1.0    0.0
2      2    1.0    0.0    0.0
3      3    0.0    0.0    1.0
4      4    1.0    0.0    0.0
5      5    0.0    1.0    0.0